const emoji = {
  expression: [
    {
      text: '😀',
      desc: '笑嘻嘻',
    },
    {
      text: '😁',
      desc: '笑嘻嘻的脸，含笑的眼睛',
    },
    {
      text: '😂',
      desc: '脸上带着喜悦的泪水',
    },
    {
      text: '😃',
      desc: '开口笑脸',
    },
    {
      text: '😄',
      desc: '开口笑脸和微笑的眼睛',
    },
    {
      text: '😅',
      desc: '笑脸淌冷汗',
    },
    {
      text: '😆',
      desc: '开口笑紧闭的眼睛',
    },
    {
      text: '😉',
      desc: '眨眼表情',
    },
    {
      text: '😊',
      desc: '面带微笑的眼睛',
    },
    {
      text: '😋',
      desc: '品尝美味食物表情',
    },
    {
      text: '😎',
      desc: '太阳镜笑脸',
    },
    {
      text: '😍',
      desc: '面带心形眼睛',
    },
    {
      text: '😘',
      desc: '飞吻表情',
    },
    {
      text: '😗',
      desc: '亲吻表情',
    },
    {
      text: '😙',
      desc: '含笑亲吻表情',
    },
    {
      text: '😚',
      desc: '闭眼亲吻表情',
    },
    {
      text: '😇',
      desc: '光环笑脸',
    },
    {
      text: '😐',
      desc: '中性面',
    },
    {
      text: '😑',
      desc: '面无表情',
    },
    {
      text: '😶',
      desc: '没有嘴的脸',
    },
    {
      text: '😏',
      desc: '傻笑',
    },
    {
      text: '😣',
      desc: '坚持',
    },
    {
      text: '😥',
      desc: '失望得到宽慰的脸',
    },
    {
      text: '😮',
      desc: '张着嘴',
    },
    {
      text: '😯',
      desc: '安静的脸',
    },
    {
      text: '😪',
      desc: '困',
    },
    {
      text: '😫',
      desc: '疲惫',
    },
    {
      text: '😴',
      desc: '熟睡',
    },
    {
      text: '😌',
      desc: '安心',
    },
    {
      text: '😛',
      desc: '吐舌头',
    },
    {
      text: '😜',
      desc: '吐舌头，眨眼眼',
    },
    {
      text: '😝',
      desc: '闭眼吐舌头',
    },
    {
      text: '😒',
      desc: '垂头丧气',
    },
    {
      text: '😓',
      desc: '冷汗',
    },
    {
      text: '😔',
      desc: '沉思',
    },
    {
      text: '😕',
      desc: '困惑',
    },
    {
      text: '😷',
      desc: '戴口罩',
    },
    {
      text: '😖',
      desc: '被打败',
    },
    {
      text: '😞',
      desc: '失望',
    },
    {
      text: '😟',
      desc: '忧伤',
    },
    {
      text: '😤',
      desc: '面带胜利',
    },
    {
      text: '😢',
      desc: '哭泣的脸',
    },
    {
      text: '😭',
      desc: '大声哭泣的脸',
    },
    {
      text: '😦',
      desc: '张嘴哭',
    },
    {
      text: '😧',
      desc: '痛苦',
    },
    {
      text: '😨',
      desc: '恐惧',
    },
    {
      text: '😬',
      desc: '狰狞',
    },
    {
      text: '😰',
      desc: '淌冷汗',
    },
    {
      text: '😱',
      desc: '尖叫恐惧',
    },
    {
      text: '😳',
      desc: '红扑扑的脸蛋',
    },
    {
      text: '😵',
      desc: '晕',
    },
    {
      text: '😡',
      desc: '噘嘴',
    },
    {
      text: '😠',
      desc: '愤怒',
    },
    {
      text: '😈',
      desc: '长角的笑脸',
    },
    {
      text: '👿',
      desc: '恶魔',
    },
    {
      text: '👹',
      desc: '日本食人魔',
    },
    {
      text: '👺',
      desc: '日本哥布林',
    },
    {
      text: '💀',
      desc: '头骨',
    },
    {
      text: '☠',
      desc: '骷髅头',
    },
    {
      text: '👻',
      desc: '鬼',
    },
    {
      text: '👽',
      desc: '外星异形',
    },
  ],
};

export default emoji;
